README.org
#+title: bauer: an Emacs+Nix IDE
#+author: Matthew Bauer
#+email: mjbauer95@gmail.com
#+subtitle: Bauer’s Automated Unified Emacs Realm
#+description: My Emacs configuration
#+language: en
#+options: c:nil d:t e:t f:t H:3 p:nil ':t *:t -:t ::t <:t \n:nil ^:{} |:t
#+options: arch:nil author:t broken-links:nil
#+options: creator:t date:t email:t inline:nil num:nil pri:t
#+options: prop:nil stat:t tags:nil tasks:nil tex:t timestamp:t title:t toc:nil
#+property: header-args :cache yes :comments link
#+property: header-args:emacs-lisp :results output silent
#+latex_header: \usepackage{inconsolata}
#+tags: noexport notangle
#+startup: hideblocks align entitiespretty
#+export_file_name: index
#+keywords: dotfiles config ide emacs nix bauer
#+html_head: <link rel="stylesheet" href="https://matthewbauer.us/style.css" /> <meta name="viewport" content="width=device-width, initial-scale=1.0" />
#+link_home: https://matthewbauer.us
#+link_up: http://matthewbauer.us/bauer/
#+version: 1.5.3

This ORG-mode file generates an Emacs configuration. I am calling it an
[[https://www.gnu.org/s/emacs/][Emacs]]+[[https://nixos.org][Nix]] IDE. That is, the Emacs configuration is /integrated/ with hardcoded
Nix store paths. This provides a kind of functional Emacs configuration. The
integration between Emacs & Nix comes with lots of useful side effects. The raw
Org file can always be downloaded [[https://matthewbauer.us/bauer/README.org][here]]. You can create pull requests & issues on
[[https://github.com/matthewbauer/bauer][the GitHub repo]]. You can access my website at https://matthewbauer.us.

#+TOC: headlines 2

* Usage
:PROPERTIES:
:header-args: :tangle no
:CUSTOM_ID: usage
:END:

** Installing/upgrading
:PROPERTIES:
:CUSTOM_ID: install
:END:

This is the script that I use to setup all of my new machines but it's portable
enough for anyone to use.

To install, just run this command from your shell:

#+BEGIN_SRC shell
curl https://matthewbauer.us/bauer/install | sh
#+END_SRC

Once it’s installed, you can open Emacs at any time with this command:

#+BEGIN_SRC shell
"$HOME/.nix-profile/bin/run"
#+END_SRC

If you don't like it, it's also very easy to uninstall. Just run:

#+BEGIN_SRC shell
nix-env -e bauer
nix-collect-garbage -d
#+END_SRC

** Developing
:PROPERTIES:
:CUSTOM_ID: develop
:END:

After you’ve installed it, it’s easy to make changes. By default, the
configuration lives in =~/.local/share/bauer=. To make changes just follow this
process,

#+BEGIN_SRC shell
cd ~/.local/share/bauer
nix-build
./result/run README.org
#+END_SRC

The last line will spawn an Emacs frame in the Git repo. Anything in that file
can be change. Once you’ve made a change, just run =M-x dev-restart= to rebuild
the configuration & restart Emacs. Make any changes you want to [[./README.org][the README.org
file]] or any of the files in [[./site-lisp][the site-lisp folder]]. Make sure you commit your
changes afterward by typing =C-c p v=, then =cc=. If you have already forked
[[https://github.com/matthewbauer/bauer][this repo on GitHub]], you can add it as a remote by typing =Mg= followed by your
GitHub username within Magit. To push to it, just type =Pr= then find your
username in the list & press enter. Pull requests are always welcome through
GitHub!

** Without Nix
:PROPERTIES:
:CUSTOM_ID: nonix
:header-args: :tangle no
:END:

You can also use this configuration without Nix. This just gives you the Emacs
configuration without any of the Nix integrations. All of the binaries will have
to be provided externally. To get started, run the following:

#+BEGIN_SRC shell
mv ~/.emacs.d ~/.emacs.d.old
git clone https://github.com/matthewbauer/bauer \
          ~/.emacs.d
#+END_SRC

* Emacs init file
:PROPERTIES:
:header-args: :tangle yes :comments link
:CUSTOM_ID: emacs
:END:

This is the main part of the IDE. It is written in Emacs Lisp & will be loaded
every time Emacs is started.

** Increase GC

Increasing GC is a common way to speed up Emacs. =gc-cons-threshold= sets at
what point Emacs should invoke its garbage collector Some people set it to a
really larger number permanently. This works well until the garbage is actually
collected (then you have to wait a long time). I’ve decided to just set it
temporarily to a large number so we only garbage collect once on startup. After
that we reset it to the standard value. Read [[http://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/][@bling’s post]] for more info on
this.

#+BEGIN_SRC emacs-lisp :padline no
  ;; -*- mode: emacs-lisp; coding: utf-8; -*-

  (defvar file-name-handler-alist-backup
          file-name-handler-alist)
  (setq gc-cons-threshold most-positive-fixnum
        file-name-handler-alist nil)
  (add-hook 'after-init-hook
    (lambda ()
      (garbage-collect)
      (setq gc-cons-threshold
              (car (get 'gc-cons-threshold 'standard-value))
        file-name-handler-alist
          (append
            file-name-handler-alist-backup
            file-name-handler-alist))))
#+END_SRC

** Autoloads & Misc.

Setup some initial aliases for Emacs. These give us an easy way to use these
functions without actually require'ing them. Ideally, Emacs should pick these up
through the automatic autoloading method, but that sometimes conflicts with the
compiling phases used later.

#+BEGIN_SRC emacs-lisp
  (eval-and-compile
    (autoload 'package-installed-p "package")
    (autoload 'use-package-autoload-keymap "use-package")
    (autoload 'pcomplete-arg "pcomplete")
    (autoload 'pcomplete--here "pcomplete")
    (autoload 'tramp-tramp-file-p "tramp")
    (autoload 'tramp-dissect-file-name "tramp")

    (defvar view-mode-map)
    (defvar iso-transl-ctl-x-8-map)
    (defvar dired-mode-map))
#+END_SRC

When we are within a terminal we want to be able to use the mouse, so
=xterm-mouse-mode= is enabled here.

iTerm doesn’t seem to support xterm color reporting correctly, so we use the
COLORFGBG method.

#+BEGIN_SRC emacs-lisp
  (unless (display-graphic-p)
    (xterm-mouse-mode 1)

    (when (string-equal (getenv "TERM_PROGRAM") "iTerm.app")
      (add-hook 'after-make-frame-functions
                '(lambda
                   ;; Take advantage of iterm2's CSI u support (https://gitlab.com/gnachman/iterm2/-/issues/8382).
                   (xterm--init-modify-other-keys)

                   ;; Courtesy https://emacs.stackexchange.com/a/13957, modified per
                   ;; https://gitlab.com/gnachman/iterm2/-/issues/8382#note_365264207
                   (defun character-apply-modifiers (c &rest modifiers)
                     "Apply modifiers to the character C.
  MODIFIERS must be a list of symbols amongst (meta control shift).
  Return an event vector."
                     (if (memq 'control modifiers) (setq c (if (and (<= ?a c) (<= c ?z))
                                                               (logand c ?\x1f)
                                                             (logior (lsh 1 26) c))))
                     (if (memq 'meta modifiers) (setq c (logior (lsh 1 27) c)))
                     (if (memq 'shift modifiers) (setq c (logior (lsh 1 25) c)))
                     (vector c))
                   (when (and (boundp 'xterm-extra-capabilities) (boundp 'xterm-function-map))
                     (let ((c 32))
                       (while (<= c 126)
                         (mapc (lambda (x)
                                 (define-key xterm-function-map (format (car x) c)
                                   (apply 'character-apply-modifiers c (cdr x))))
                               '(;; with ?.VT100.formatOtherKeys: 0
                                 ("\e\[27;3;%d~" meta)
                                 ("\e\[27;5;%d~" control)
                                 ("\e\[27;6;%d~" control shift)
                                 ("\e\[27;7;%d~" control meta)
                                 ("\e\[27;8;%d~" control meta shift)
                                 ;; with ?.VT100.formatOtherKeys: 1
                                 ("\e\[%d;3u" meta)
                                 ("\e\[%d;5u" control)
                                 ("\e\[%d;6u" control shift)
                                 ("\e\[%d;7u" control meta)
                                 ("\e\[%d;8u" control meta shift)))
                         (setq c (1+ c)))))
                   ))

      ;; ;; xterm--report-background-handler init fails, but we can still
      ;; ;; use COLORFGBG
      ;; (defvar xterm-extra-capabilities)
      ;; (setq xterm-extra-capabilities '(modifyOtherKeys getSelection setSelection))
      (autoload 'rxvt-set-background-mode "term/rxvt")
      (add-hook 'window-setup-hook 'rxvt-set-background-mode)
      ))
#+END_SRC

** Custom config

[[./lisp/set-defaults.el][set-defaults]] provides an easy way to override the default custom files. This
means that when you customize a variable it will appear as ‘standard’ even
though it’s not what the package originally defined as the default. This is
useful for an Emacs distribution to provide /better defaults/ while still
letting the user override them. Look through the lispdoc of the package for
documentation on how this works. Eventually, this will be added to MELPA for use
in other Emacs distributions.

#+BEGIN_SRC emacs-lisp
  (require 'set-defaults)
#+END_SRC

