README.org
** =init.el=

You can use this as part of [[~/.emacs.d/init.el][your Emacs init file]]:

#+BEGIN_SRC emacs-lisp :tangle init.el
(load
  (expand-file-name "settings.el" user-emacs-directory) t)
(package-initialize)
(defvar bauer-dir user-emacs-directory)
(defvar bauer-org
        (expand-file-name "README.org" bauer-dir))
(add-to-list 'load-path
             (expand-file-name "site-lisp" bauer-dir))
(unless (file-exists-p
          (expand-file-name "README.el" bauer-dir))
  (let ((default-directory bauer-dir))
    (autoload 'org-babel-tangle-file "ob-tangle")
    (org-babel-tangle-file bauer-org
                          "README.el"
                          "emacs-lisp")))
(load (expand-file-name "README.el" bauer-dir) t)
#+END_SRC

This will boot the IDE. Note that this is done for you in the Nix-based
installation process. The above script should be used in places where Nix is
unavailable.

** NixOS module
:PROPERTIES:
:header-args: :tangle module.nix :padline no
:END:

I’ve provided a module suitable for use with a NixOS configuration. To use it,
just add something like the following to your configuration.nix file.

#+BEGIN_SRC nix :tangle no :padline no
# -*- mode: nix; coding: utf-8; -*-
{ ... }:
{
  imports = [
    (builtins.fetchurl "https://matthewbauer.us/bauer/module.nix")
  ];
  programs.bauer.enable = true;
}
#+END_SRC

The actual module implementation follow here. It will pull in some files needed
for all of this to work. It should provide ‘bauer’ as a runnable command.

#+BEGIN_SRC nix
# -*- mode: nix; coding: utf-8; -*-
{ config, lib, pkgs, ... }: with lib;

let
  ensure = f: n: if builtins.pathExists f then f
                 else builtins.fetchurl
    "https://matthewbauer.us/bauer/${n}";
  bauer = import (ensure ./default.nix "default.nix") {
    inherit pkgs;
  };
in {
  options = {
    programs.bauer = {
      enable = mkOption {
        default = false;
        type = types.bool;
      };
    };
  };

  config = mkIf config.programs.bauer.enable {
    environment = {
      systemPackages = [ bauer ];
      variables = with lib; {
        PATH = [bauer.PATH];
        XDG_DATA_DIRS = [bauer.XDG_DATA_DIRS];
        TERMINFO_DIRS = [bauer.TERMINFO_DIRS];
        MANPATH = [bauer.MANPATH];
        INFOPATH = [bauer.INFOPATH];
      };
    };
  };
}
#+END_SRC
** NixOS virtualbox & installer

Use this to build a .ova file for demonstration purposes. This file can be
booted by VirtualBox. Useful for Windows users especially.

#+BEGIN_SRC nix :tangle no :padline no
# -*- mode: nix; coding: utf-8; -*-
{ system ? builtins.currentSystem }:
let
  ensure = f: n: if builtins.pathExists f then f
                 else builtins.fetchurl
    "https://matthewbauer.us/bauer/${n}";
in {
  ova = (import <nixpkgs/nixos/lib/eval-config.nix> {
    inherit system;
    modules = [
      <nixpkgs/nixos/modules/installer/virtualbox-demo.nix>
      (ensure ./module.nix "module.nix")
    ];
  }).config.system.build.virtualBoxOVA;
  iso = (import <nixpkgs/nixos/lib/eval-config.nix> {
    inherit system;
    modules = [
      <nixpkgs/nixos/modules/installer/cd-dvd/installation-cd-graphical-kde.nix>
      (ensure ./module.nix "module.nix")
    ];
  }).config.system.build.isoImage;
}
#+END_SRC

** Flake
:PROPERTIES:
:header-args: :tangle flake.nix :padline no
:END:

#+BEGIN_SRC nix :tangle flake.nix :padline no
  {
    description = "an Emacs+Nix IDE";

    inputs.nixpkgs.url = "nixpkgs/nixos-unstable";
    inputs.emacs-overlay.url = "github:nix-community/emacs-overlay";

    outputs = { self, nixpkgs, emacs-overlay }: let
      systems = [ "x86_64-linux" "i686-linux" "x86_64-darwin" "aarch64-linux" "aarch64-darwin" ];
      forAllSystems = f: nixpkgs.lib.genAttrs systems (system: f system);
      nixpkgsFor = forAllSystems (system: import nixpkgs { inherit system; });
    in {
      packages = forAllSystems (system: {
        bauer = let
          pkgs = nixpkgsFor.${system};
          evalPkgs = nixpkgsFor.${system};
        in import (evalPkgs.runCommand "README" {
          buildInputs = with evalPkgs; [ pkgs.emacs git ];
        } (''
          install -D ${./README.org} $out/README.org
          cd $out
          cp -r ${./site-lisp} site-lisp
          emacs --batch --quick \
                -l ob-tangle \
                --eval "(org-babel-tangle-file \"README.org\")" > /dev/null
          cp bauer.nix default.nix
        '')) { inherit pkgs emacs-overlay evalPkgs; };
      });

      defaultPackage = forAllSystems (system: self.packages.${system}.bauer);

      apps = forAllSystems (system: {
        bauer = {
          type = "app";
          program = "${self.packages.${system}.bauer}/bin/run";
        };
      });

      defaultApp = forAllSystems (system: self.apps.${system}.bauer);

      devShell = forAllSystems (system:
        with nixpkgsFor.${system};
        stdenv.mkDerivation {
          name = "bauer";
          nativeBuildInputs = [ pkgs.emacs git ];
          shellHook = ''
            echo Run ./update.sh to generate files.
          '';
        });

      nixosModules.bauer = {
        imports = [ ./module.nix ];
      };
    };
  }
#+END_SRC
** Deploy script
:PROPERTIES:
:header-args: :tangle deploy.sh :shebang "#!/usr/bin/env sh"
:END:

I use this script to deploy to the gh-pages branch. It merges master into
gh-pages and then runs ORG mode tangle and export. Unfortunately, merge
conflicts are not handled, and must be dealt with manually.

#+BEGIN_SRC shell
  setup() {
    git stash push
    git checkout gh-pages
  }

  cleanup() {
    git checkout master
    git stash pop
  }

  setup
  trap cleanup EXIT

  git fetch origin
  git reset --hard origin/gh-pages
  git merge --no-edit master
  ./update.sh
  git add .
  git commit -m "Regen"
  git push origin gh-pages
#+END_SRC
** Gist script
:PROPERTIES:
:header-args: :tangle gist-unpack.sh :shebang "#!/usr/bin/env bash"
:END:

Private file handling for new environments. Unpack private files from a Gist
into your environment. Must have already setup SSH GitHub authentication. To set
up GitHub SSH run:

#+BEGIN_SRC shell :tangle no
$ ssh-keygen
#+END_SRC

Then, add =$HOME/.ssh/id_rsa=.pub through GitHub’s Web UI. Invoke the script
with:

#+BEGIN_SRC shell :tangle no
$ ./gist-unpack.sh 4a7372cf458f2b322c0b7a6e7837592f
#+END_SRC

Files that can be included in the gist are:

- .authinfo: stores your passwords and credentials. Domains like smtp.gmail.com,
  api.github.com, and irc.freenode.net require credentials.
- .gitconfig: stores your personal Git configuration and settings. Things like
  user.email, user.name, github.user should go here. Unfortunately, it also may
  have credentials for smtpmail. Ideally these would be put in .authinfo to
  avoid mixing secrets. See [[https://lists.gnu.org/archive/html/guix-devel/2018-04/msg00254.html][this thread]] for more info.
- .sshconfig: stores your SSH configuration corresponding to .ssh/config. Put
  global host names and relates settings here.
- settings.el: store your personal Emacs configurations. Settings like
  =erc-nick=, =message-send-mail-function=, =send-mail-function=,
  =smtpmail-smtp-server=, =smtpmail-smtp-service=, =user-full-name=, and
  =user-mail-address= should go here.

The actual script follows. The main idea is just to download all of the files
from the Gist and copy them to the =$HOME= directory. =--force= can be passed to
allow overriding your current =$HOME= files.

#+BEGIN_SRC shell
  if [ $# -eq 0 ]; then
      echo Usage: "$0" [ GIST_ID | URL ] [ -u USER ] [ -t TOKEN ] >&2
      exit 1
  fi

  FORCE=
  GIST_ID=
  USER=
  TOKEN=
  URL=
  while [ $# -gt 0 ]; do
      case "$1" in
          -f|--force)
              echo Forcing install... >&2
              FORCE=1
              shift
              ;;
          -u|--user)
              if [ -n "$USER" ]; then
                  echo Multiple users passed! >&2
                  exit 1
              fi
              shift
              USER="$1"
              shift
              ;;
          -t|--token)
              if [ -n "$TOKEN" ]; then
                  echo Multiple tokens passed! >&2
                  exit 1
              fi
              shift
              TOKEN="$1"
              shift
              ;;
          -g|--gist-id)
              if [ -n "$GIST_ID" ] || [ -n "$URL" ]; then
                  echo Multiple URLs or Gist ids passed! >&2
                  exit 1
              fi
              shift
              GIST_ID="$1"
              shift
              ;;
          -u|--url)
              if [ -n "$GIST_ID" ] || [ -n "$URL" ]; then
                  echo Multiple URLs or Gist ids passed! >&2
                  exit 1
              fi
              shift
              URL="$1"
              shift
              ;;
          https://*|ssh://*|git://*)
               if [ -n "$GIST_ID" ] || [ -n "$URL" ]; then
                  echo Multiple URLs or Gist ids passed! >&2
                  exit 1
              fi
              URL="$1"
              shift
              ;;
          ,*)
              if [ -n "$GIST_ID" ] || [ -n "$URL" ]; then
                  echo Multiple URLs or Gist ids passed! >&2
                  exit 1
              fi
              GIST_ID="$1"
              echo Using gist "$GIST_ID" >&2
              shift
              ;;
      esac
  done

  if [ -n "$GIST_ID" ]; then
    URL=ssh://git@github.com/"$GIST_ID".git
  fi

  if [ -z "$URL" ]; then
      echo No gist id or url provided. >&2
      exit 1
  fi

  mkdir -p $HOME/.ssh
  echo "github.com ssh-rsa AAAAB3NzaC1yc2EAAAABIwAAAQEAq2A7hRGmdnm9tUDbO9IDSwBK6TbQa+PXYPCPy6rbTrTtw7PHkccKrpp0yVhp5HdEIcKr6pLlVDBfOLX9QUsyCOV0wzfjIJNlGEYsdlLJizHhbn2mUjvSAHQqZETYP81eFzLQNnPHt4EVVUh7VfDESU84KezmD5QlWpXLmvU31/yMf+Se8xhHTvKSCZIFImWwoG6mbUoWf9nzpIoaSjB+weqqUUmpaaasXVal72J+UX2B+2RPW3RcT0eOzQgqlJL3RKrTJvdsjE3JEAvGq3lGHSZXy28G3skua2SmVi/w4yCE6gbODqnTWlg7+wC604ydGXA8VJiS5ap43JXiUFFAaQ==" >> $HOME/.ssh/known_hosts

  ssh -T git@github.com 2> /dev/null
  if [ $? -eq 255 ]; then
      if ! [ -f "$HOME/.ssh/id_rsa" ]; then
          echo No ssh key is available. Generating it and adding it to GitHub to continue.
          ssh-keygen -t rsa -N "" -f "$HOME/.ssh/id_rsa"
      fi

      if [ -z "$USER" ] && [ -t 1 ]; then
          echo -n "GitHub Username: "; read USER
      fi
      if [ -z "$USER" ]; then
          echo Username cannot be empty. Pass -u with your username to continue.
          exit 1
      fi
      auth="$USER"
      if [ -n "$TOKEN" ]; then
          auth="$auth:$TOKEN"
      fi
      curl -u "$auth" -d "$(printf '{"title": "%s", "key": "%s"}' "${HOST-$(hostname)}" "$(cat $HOME/.ssh/id_rsa.pub)")" https://api.github.com/user/keys > /dev/null
  fi

  gistdir="$(mktemp -d)"
  setup() {
      if ! git clone "$URL" "$gistdir"; then
          echo Failed to clone Gist. Verify "$URL" exists >&2
          echo and you have permission to access it. >&2
          exit 1
      fi

      pushd "$gistdir" >/dev/null
  }

  cleanup() {
      popd >/dev/null
      rm -rf "$gistdir"
  }

  setup
  trap cleanup EXIT

  if [ -n "${BASH_VERSION-}" ]; then
      shopt -s dotglob
  fi
  shopt -s nullglob
  for f in *; do
      if [ "$f" = ".git" ]; then
          continue
      fi
      if ! [ -f "$f" ]; then
          echo Skipping "$f", not a file >&2
          continue
      fi
      DEST=
      case "$f" in
          settings.el) DEST="$HOME/.config/emacs/settings.el" ;;
          .sshconfig) DEST="$HOME/.ssh/config" ;;
          .ssh_authorized_keys) DEST="$HOME/.ssh/authorized_keys" ;;
          nix.conf) DEST="$HOME/.config/nix/nix.conf" ;;
          machines) DEST="$HOME/.config/nix/machines" ;;
          .gitignore) DEST="$HOME/.config/git/ignore" ;;
          .gitconfig) DEST="$HOME/.config/git/config" ;;
          .gitattributes) DEST="$HOME/.config/git/attributes" ;;
          credentials|.aws_credentials) DEST="$HOME/.aws/credentials" ;;
          ,*) DEST="$HOME/$f" ;;
      esac
      CONCAT=
      case "$f" in
          .authinfo) CONCAT=1 ;;
          .sshconfig) CONCAT=1 ;;
          .ssh_authorized_keys) CONCAT=1 ;;
          .gitignore) CONCAT=1 ;;
          nix.conf) CONCAT=1 ;;
          machines) CONCAT=1 ;;
      esac
      if [ -z "$DEST" ]; then
          echo Skipping "$f", no destination found >&2
          continue
      fi
      if [ -f "$DEST" ] && [ -z "$FORCE" ] && [ -z "$CONCAT" ]; then
          echo Skipping "$f", destination already exists >&2
          continue
      fi
      mkdir -p "$(dirname "$DEST")"
      if [ -n "$CONCAT" ]; then
          cat "$f" >> "$DEST"
      else
          cp "$f" "$DEST"
      fi
      if [ "$f" = .authinfo ]; then
          chmod 600 "$DEST"
      fi
  done
#+END_SRC

** LICENSE
   Copyright © 2018-2020 Matthew Bauer

   This program is free software: you can redistribute it and/or modify it under
   the terms of the GNU General Public License as published by the Free Software
   Foundation, either version 3 of the License, or (at your option) any later
   version.

   This program is distributed in the hope that it will be useful, but WITHOUT
   ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
   FOR A PARTICULAR PURPOSE. See the GNU General Public License for more
   details.

   You should have received a copy of the GNU General Public License along with
   this program. If not, see <http://www.gnu.org/licenses/>.
* COMMENT Footer
# Local Variables:
# mode: org
# bug-reference-url-format: "https://github.com/matthewbauer/bauer/issues/%s"
# coding: utf-8
# compile-command: "nix-build"
# fill-column: 80
# sentence-end-double-space: nil
# indent-tabs-mode: nil
# End:
